# Homework 1

# Part 1: Python Intro

For this part, you will have more exercises to get more familar with Python. Just go along with this notebook and try to complete the instructions or answer the questions using your Python skills!

In [1]:
x=[1,2,3,4]

** Generate the following list from the above list 'x' by using 'list comprehension'. (Refer to the following link for more detail: https://www.pythonforbeginners.com/basics/list-comprehensions-in-python) **

In [2]:
[a*a for a in x]

[1, 4, 9, 16]

In [3]:
li = [3, 6, 2, 7, 1, 9]

** Generate the following list from the above list 'li' **

In [4]:
[a*2 for a in li if a >5]

[12, 14, 18]

** Split this string:**

    s = "Hi there Sam!"
    
**into a list. **

In [5]:
s = "Hi there Sam!"
s.split()

['Hi', 'there', 'Sam!']

** Given the variables:**

    planet = "Earth"
    diameter = 12742

** Use .format() to print the following string: **

    The diameter of Earth is 12742 kilometers.

In [6]:
planet = "Earth"
diameter = 12742
print("The diameter of {a1} is {a2} kilometers.".format(a1=planet,a2=diameter))

The diameter of Earth is 12742 kilometers.

** Create a function that grabs the email website domain from a string in the form: **

    user@domain.com
    
**So for example, passing "user@domain.com" would return: domain.com**

In [7]:
s="user@domain.com"
s.split("@")[1]

'domain.com'

** Create a basic function that returns True if the word 'dog' is contained in the input string. Don't worry about edge cases like a punctuation being attached to the word dog, but do account for capitalization. **
**So for example, passing "Is there a dog here?" would return: True**

In [8]:
def ifdog(str):
    if str.find("dog")!= -1:
        return True
    else: 
        return False
ifdog("Is there a dog here?" )

True

# Part 2: More about Numpy and Pandas

** For this part you will use Numpy and Pandas to answer each question. **

** Import numpy and pandas **

In [9]:
import numpy as np
import pandas as pd

## DataFrame basics

** Consider the following Python dictionary data and Python list labels: **

In [10]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'], 'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

** Create a DataFrame df from this dictionary data which has the index labels. **

In [11]:
df = pd.DataFrame(data)
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

** Display a summary of the basic information about this DataFrame and its data. **

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

** Return the first 3 rows of the DataFrame df. **

In [13]:
df.loc[0:2]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

** Select just the 'animal' and 'age' columns from the DataFrame df. **

In [14]:
df.loc[:,'animal':'age']

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

** Select the data in rows [3, 4, 8] and in columns ['animal', 'age']. **

In [15]:
df.loc[(2,3,7),'animal':'age']

  animal  age
2  snake  0.5
3    dog  NaN
7    cat  NaN

**Select only the rows where the number of visits is greater than 3.**

In [16]:
df[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

**Select the rows where the age is missing, i.e. is NaN.**

In [17]:
df[df['age'].isna()]

  animal  age  visits priority
3    dog  NaN       3      yes
7    cat  NaN       1      yes

**  Select the rows where the animal is a cat and the age is less than 3. **

In [18]:
df[(df['animal']=="cat")&(df['age']<3)]

  animal  age  visits priority
0    cat  2.5       1      yes
5    cat  2.0       3       no

**  Select the rows where the age is between 2 and 4 (inclusive).**

In [19]:
df[(df['age']>=2)&(df['age']<=4)]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
5    cat  2.0       3       no
9    dog  3.0       1       no

**  Change the age in row 'f' to 1.5.**

In [20]:
a="a b c d e f g h i j".split()
df['Row']=a
df.set_index('Row')
df.loc[df['Row']=='f','age']=1.5
df

  animal  age  visits priority Row
0    cat  2.5       1      yes   a
1    cat  3.0       3      yes   b
2  snake  0.5       2       no   c
3    dog  NaN       3      yes   d
4    dog  5.0       2       no   e
5    cat  1.5       3       no   f
6  snake  4.5       1       no   g
7    cat  NaN       1      yes   h
8    dog  7.0       2       no   i
9    dog  3.0       1       no   j

** Calculate the sum of all visits (the total number of visits).**

In [21]:
df['visits'].sum()

19

** Calculate the mean age for each different animal in df. **

In [22]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

** Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [23]:
k="01 02 03 04 05 06 07 08 09 10".split()
df['k']=k
df.drop('k',axis=1,inplace=True)

** Count the number of each type of animal in df.**

In [24]:
df.groupby('animal').count()

        age  visits  priority  Row
animal
cat       3       4         4    4
dog       3       4         4    4
snake     2       2         2    2

** Sort df first by the values in the 'age' in decending order, then by the value in the 'visit' column in ascending order.**

In [25]:
df.sort_values(by=['age','visits'],ascending=[0,1])

  animal  age  visits priority Row
8    dog  7.0       2       no   i
4    dog  5.0       2       no   e
6  snake  4.5       1       no   g
9    dog  3.0       1       no   j
1    cat  3.0       3      yes   b
0    cat  2.5       1      yes   a
5    cat  1.5       3       no   f
2  snake  0.5       2       no   c
7    cat  NaN       1      yes   h
3    dog  NaN       3      yes   d

**The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.**

In [26]:
df=df.replace({'Yes':True,'No':False})

** In the 'animal' column, change the 'snake' entries to 'python'.**

In [27]:
df['animal'].replace('snake','python',inplace=True)

## DataFrames: beyond the basics

**The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.**

 You have a DataFrame df with a column 'A' of integers. For example:

In [28]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

**How do you filter out rows which contain the same integer as the row immediately above?**

In [29]:
df['A'].unique()

array([1, 2, 3, 4, 5, 6, 7])

Given a DataFrame of numeric values, say

In [30]:
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values

**how do you subtract the row mean from each element in the row?**

In [31]:
(df.T-df.mean(axis=1)).T

          0         1         2
0  0.058152  0.233503 -0.291655
1 -0.170010  0.218374 -0.048364
2  0.426109  0.099135 -0.525244
3 -0.161326 -0.030358  0.191683
4 -0.146192 -0.236497  0.382689

Suppose you have DataFrame with 10 columns of real numbers, for example:

In [32]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

** Which column of numbers has the smallest sum? (Find that column's label.)**

In [33]:
df.sum(axis=1).nsmallest(1).index

Int64Index([4], dtype='int64')

** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?**

In [34]:
a=0
for x in df.duplicated():
    if x == True:
        a=a+1
print("The number of duplicates rows is "+str(a))

The number of duplicates rows is 0

**A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example:**

In [35]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

** For each group, find the sum of the three greatest values.**

In [36]:
groups=df.groupby(['grps'],sort=True)
groups.sum(level='grps')
##head(3)

      vals
grps
a      416
b      160
c      380

## Cleaning Data

### Making a DataFrame easier to work with

**It happens all the time: someone gives you data containing malformed strings and missing data. How do you tidy it up so you can get on with the analysis?**
<br><br>
**Consider the DataFrame to use in the following puzzles:**

In [37]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

**Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).**

In [38]:
df.loc[1,'FlightNumber']=10055
df.loc[3,'FlightNumber']=10075
df['FlightNumber']=df['FlightNumber'].astype(np.int32)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

** The From\_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame. **

In [39]:
da=pd.DataFrame({'From': [x.split('_')[0] for x in df.loc[:,'From_To']],'To': [x.split('_')[1] for x in df.loc[:,'From_To']]})
da

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)**

In [40]:
da=pd.DataFrame({'From': [x.split('_')[0].capitalize() for x in df.loc[:,'From_To']],'To': [x.split('_')[1].capitalize() for x in df.loc[:,'From_To']]})
da

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

** Delete the From_To column from df and attach the temporary DataFrame from the previous questions.**

In [41]:
df.drop('From_To',axis=1,inplace=True)
df=da.join(df)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

** In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. '(British Airways. )' should become 'British Airways'.**

In [42]:
df['Airline']=pd.Series([x.strip().strip(' ()<>!12."') for x in df['Airline']])
df

       From         To  FlightNumber  RecentDelays          Airline
0    London      Paris         10045      [23, 47]              KLM
1    Madrid      Milan         10055            []       Air France
2    London  Stockholm         10065  [24, 43, 87]  British Airways
3  Budapest      Paris         10075          [13]       Air France
4  Brussels     London         10085      [67, 32]        Swiss Air

**In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.**

**Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [43]:
a=0
for x in df['RecentDelays']:
    if len(x)>a:
        a=len(x)
for x in df['RecentDelays']:
    if len(x)<a:
        for s in range(a-len(x)):
            x.append(np.nan)
listname=list(df)
del listname[3]
for s in range(a):
    df['delay_'+str(s+1)]=[x[s] for x in df['RecentDelays']]
    listname.insert(3,'delay_'+str(3-s))

df=df.loc[:,listname]
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM
1,Madrid,Milan,10055,NaN,NaN,NaN,Air France
2,London,Stockholm,10065,24.0,43.0,87.0,British Airways
3,Budapest,Paris,10075,13.0,NaN,NaN,Air France
4,Brussels,London,10085,67.0,32.0,NaN,Swiss Air

The DataFrame should look much better now.

In [44]:
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM
1,Madrid,Milan,10055,NaN,NaN,NaN,Air France
2,London,Stockholm,10065,24.0,43.0,87.0,British Airways
3,Budapest,Paris,10075,13.0,NaN,NaN,Air France
4,Brussels,London,10085,67.0,32.0,NaN,Swiss Air

### Great Job!